public class Test {
}


// ПСЕВДОКОД
/*
    class ИмяКласса {
             типПоля1 имяПоля1; // имяПеременной1
             типПоля2 имяПоля2; // имяПеременной2

             типРезультата1 имяМетода1 (параметрыМетода1) {
                              //телоМетода1

                       }
             типРезультата2 имяМетода2 (параметрыМетода2) {  // тут мы инкапсулируем логику - это означает, ято мы держим методы рядом с нашими полями/переменными
                              //телоМетода2
                       }

    }
 */
